package skkuchin.service.domain.User;

import com.fasterxml.jackson.annotation.JsonFormat;

//@JsonFormat(shape = JsonFormat.Shape.OBJECT)
public enum Major {
    경영학과,
    글로벌경영학과,
    앙트레프레너십연계전공,
    경제학과,
    국제통상학전공,
    글로벌경제학과,
    통계학과,

    //율전
    건설환경공학부,
    건축학과,
    기계공학부,
    나노공학과,
    시스템경영공학과,
    신소재공학부,
    화학공학_고분자공학부,
    국어국문학과,
    독어독문학과,
    러시아어문학과,
    문헌정보학과,
    사학과,
    영어영문학과,
    중어중문학과,
    철학과,
    프랑스어문학과,
    한문학과,
    교육학과,
    수학교육과,
    컴퓨터교육과,
    한문교육과,
    글로벌리더학부,
    미디어커뮤니케이션학과,
    사회복지학과,
    사회학과,
    소비자학과,
    심리학과,
    아동청소년학과,
    정치외교학과,
    행정학과,
    바이오메카트로닉스학과,
    식품생명공학과,
    융합생명공학과,
    글로벌바이오메디컬공학과,
    글로벌융합학부,
    데이터사이언스융합전공,
    소프트웨어학과

}
